STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215axx_cm33.h
typedef struct
{                                  /*!< ************** Register description **************  Address offset */
  __IO uint32_t SECCFGR[4];        /*!< RCC Secure Configuration Register x (x=0 to 3)         0x000-0x00c */
  __IO uint32_t PRIVCFGR[4];       /*!< RCC Privileged Configuration Register x (x=0 to 3)     0x010-0x01c */
  __IO uint32_t RCFGLOCKR[4];      /*!< RCC Resource Configuration Lock Register x (x=0 to 3)  0x020-0x02c */
       RCC_Comp_TypeDef R[114];    /*!< RCC Resource x Compartment Configuration (x=0 to 113)  0x030-0x3bc */
       uint32_t RESERVED0[16];      /*!< Reserved                                                                       Address offset: 0x03C0-0x03FC */
  __IO uint32_t GRSTCSETR;          /*!< RCC global reset control set register                                          Address offset: 0x0400 */
  __IO uint32_t C1RSTCSETR;         /*!< RCC CPU1 reset control set register                                            Address offset: 0x0404 */
  __IO uint32_t RESERVED1;          /*!< Reserved                                                                       Address offset: 0x0408 */
  __IO uint32_t C2RSTCSETR;         /*!< RCC CPU2 reset control set register                                            Address offset: 0x040C */
  __IO uint32_t HWRSTSCLRR;         /*!< RCC hardware reset status clear register                                       Address offset: 0x0410 */
  __IO uint32_t C1HWRSTSCLRR;       /*!< RCC CPU1 hardware reset status clear register                                  Address offset: 0x0414 */
  __IO uint32_t C2HWRSTSCLRR;       /*!< RCC CPU2 hardware reset status clear register                                  Address offset: 0x0418 */
  __IO uint32_t C1BOOTRSTSSETR;     /*!< RCC CPU1 boot reset status set register                                        Address offset: 0x041C */
  __IO uint32_t C1BOOTRSTSCLRR;     /*!< RCC CPU1 boot reset status clear register                                      Address offset: 0x0420 */
  __IO uint32_t C2BOOTRSTSSETR;     /*!< RCC CPU2 boot reset status set register                                        Address offset: 0x0424 */
  __IO uint32_t C2BOOTRSTSCLRR;     /*!< RCC CPU2 boot reset status clear register                                      Address offset: 0x0428 */
  __IO uint32_t C1SREQSETR;         /*!< RCC CPU1 stop request set register                                             Address offset: 0x042C */
  __IO uint32_t C1SREQCLRR;         /*!< RCC CPU1 stop request clear register                                           Address offset: 0x0430 */
  __IO uint32_t CPUBOOTCR;          /*!< RCC CPU boot control register                                                  Address offset: 0x0434 */
  __IO uint32_t STBYBOOTCR;         /*!< RCC standby boot control register                                              Address offset: 0x0438 */
  __IO uint32_t LEGBOOTCR;          /*!< RCC legacy boot control register                                               Address offset: 0x043C */
  __IO uint32_t BDCR;               /*!< RCC backup domain control register                                             Address offset: 0x0440 */
       uint32_t RESERVED2[2];       /*!< Reserved                                                                       Address offset: 0x0444-0x0448 */
  __IO uint32_t RDCR;               /*!< RCC reset duration control register                                            Address offset: 0x044C */
  __IO uint32_t C1MSRDCR;           /*!< RCC C1MS reset delay control register                                          Address offset: 0x0450 */
  __IO uint32_t PWRLPDLYCR;         /*!< RCC PWR_LP delay control register                                              Address offset: 0x0454 */
  __IO uint32_t C1CIESETR;          /*!< RCC CPU1 clock source interrupt enable set register                            Address offset: 0x0458 */
  __IO uint32_t C1CIFCLRR;          /*!< RCC CPU1 clock source interrupt flag clear register                            Address offset: 0x045C */
  __IO uint32_t C2CIESETR;          /*!< RCC CPU2 clock source interrupt enable set register                            Address offset: 0x0460 */
  __IO uint32_t C2CIFCLRR;          /*!< RCC CPU2 clock source interrupt flag clear register                            Address offset: 0x0464 */
  __IO uint32_t IWDGC1FZSETR;       /*!< RCC IWDG CPU1 clock freeze set register                                        Address offset: 0x0468 */
  __IO uint32_t IWDGC1FZCLRR;       /*!< RCC IWDG CPU1 clock freeze clear register                                      Address offset: 0x046C */
  __IO uint32_t IWDGC1CFGSETR;      /*!< RCC IWDG CPU1 configuration set register                                       Address offset: 0x0470 */
  __IO uint32_t IWDGC1CFGCLRR;      /*!< RCC IWDG CPU1 configuration clear register                                     Address offset: 0x0474 */
  __IO uint32_t IWDGC2FZSETR;       /*!< RCC IWDG CPU2 clock freeze set register                                        Address offset: 0x0478 */
  __IO uint32_t IWDGC2FZCLRR;       /*!< RCC IWDG CPU2 clock freeze clear register                                      Address offset: 0x047C */
  __IO uint32_t IWDGC2CFGSETR;      /*!< RCC IWDG CPU2 configuration set register                                       Address offset: 0x0480 */
  __IO uint32_t IWDGC2CFGCLRR;      /*!< RCC IWDG CPU2 configuration clear register                                     Address offset: 0x0484 */
  __IO uint32_t MCO1CFGR;           /*!< RCC MCO1 configuration register                                                Address offset: 0x0488 */
  __IO uint32_t MCO2CFGR;           /*!< RCC MCO2 configuration register                                                Address offset: 0x048C */
  __IO uint32_t OCENSETR;           /*!< RCC oscillator clock enable set register                                       Address offset: 0x0490 */
  __IO uint32_t OCENCLRR;           /*!< RCC oscillator clock enable clear register                                     Address offset: 0x0494 */
  __IO uint32_t OCRDYR;             /*!< RCC oscillator clock ready register                                            Address offset: 0x0498 */
  __IO uint32_t HSICFGR;            /*!< RCC HSI configuration register                                                 Address offset: 0x049C */
  __IO uint32_t MSICFGR;            /*!< RCC MSI configuration register                                                 Address offset: 0x04A0 */
  __IO uint32_t LSICR;              /*!< RCC LSI control register                                                       Address offset: 0x04A4 */
  __IO uint32_t RTCDIVR;            /*!< RCC RTC clock divider register                                                 Address offset: 0x04A8 */
  __IO uint32_t APB1DIVR;           /*!< RCC APB1 clock divider register                                                Address offset: 0x04AC */
  __IO uint32_t APB2DIVR;           /*!< RCC APB2 clock divider register                                                Address offset: 0x04B0 */
  __IO uint32_t APB3DIVR;           /*!< RCC APB3 clock divider register                                                Address offset: 0x04B4 */
  __IO uint32_t APB4DIVR;           /*!< RCC APB4 clock divider register                                                Address offset: 0x04B8 */
  __IO uint32_t APB5DIVR;           /*!< RCC APB5 clock divider register                                                Address offset: 0x04BC */
  __IO uint32_t APBDBGDIVR;         /*!< RCC APBDBG clock divider register                                              Address offset: 0x04C0 */
       uint32_t RESERVED3;          /*!< Reserved                                                                       Address offset: 0x04C4 */
  __IO uint32_t TIMG1PRER;          /*!< RCC TIM group 1 prescaler register                                             Address offset: 0x04C8 */
  __IO uint32_t TIMG2PRER;          /*!< RCC TIM group 2 prescaler register                                             Address offset: 0x04CC */
  __IO uint32_t LSMCUDIVR;          /*!< RCC LSMCU clock divider register                                               Address offset: 0x04D0 */
  __IO uint32_t DDRCPCFGR;          /*!< RCC DDRC AXI port configuration register                                       Address offset: 0x04D4 */
  __IO uint32_t DDRCAPBCFGR;        /*!< RCC DDRC APB configuration register                                            Address offset: 0x04D8 */
  __IO uint32_t DDRPHYCAPBCFGR;     /*!< RCC DDRPHYC APB configuration register                                         Address offset: 0x04DC */
  __IO uint32_t DDRPHYCCFGR;        /*!< RCC DDRPHYC configuration register                                             Address offset: 0x04E0 */
  __IO uint32_t DDRCFGR;            /*!< RCC DDR configuration register                                                 Address offset: 0x04E4 */
  __IO uint32_t DDRITFCFGR;         /*!< RCC DDR interface configuration register                                       Address offset: 0x04E8 */
       uint32_t RESERVED4;          /*!< Reserved                                                                       Address offset: 0x04EC */
  __IO uint32_t SYSRAMCFGR;         /*!< RCC SYSRAM configuration register                                              Address offset: 0x04F0 */
       uint32_t RESERVED5;          /*!< Reserved                                                                       Address offset: 0x04F4 */
  __IO uint32_t SRAM1CFGR;          /*!< RCC SRAM1 configuration register                                               Address offset: 0x04F8 */
       uint32_t RESERVED6;          /*!< Reserved                                                                       Address offset: 0x04FC */
  __IO uint32_t RETRAMCFGR;         /*!< RCC RETRAM configuration register                                              Address offset: 0x0500 */
  __IO uint32_t BKPSRAMCFGR;        /*!< RCC BKPSRAM configuration register                                             Address offset: 0x0504 */
       uint32_t RESERVED7[3];       /*!< Reserved                                                                       Address offset: 0x0508-0x0510 */
  __IO uint32_t OSPI1CFGR;          /*!< RCC OCTOSPI1 configuration register                                            Address offset: 0x0514 */
  __IO uint32_t RESERVED8;          /*!< Reserved                                                                       Address offset: 0x0518 */
  __IO uint32_t FMCCFGR;            /*!< RCC FMC configuration register                                                 Address offset: 0x051C */
  __IO uint32_t DBGCFGR;            /*!< RCC debug configuration register                                               Address offset: 0x0520 */
  __IO uint32_t STMCFGR;            /*!< RCC STM configuration register                                                 Address offset: 0x0524 */
  __IO uint32_t ETRCFGR;            /*!< RCC ETR configuration register                                                 Address offset: 0x0528 */
  __IO uint32_t GPIOACFGR;          /*!< RCC GPIOA configuration register                                               Address offset: 0x052C */
  __IO uint32_t GPIOBCFGR;          /*!< RCC GPIOB configuration register                                               Address offset: 0x0530 */
  __IO uint32_t GPIOCCFGR;          /*!< RCC GPIOC configuration register                                               Address offset: 0x0534 */
  __IO uint32_t GPIODCFGR;          /*!< RCC GPIOD configuration register                                               Address offset: 0x0538 */
  __IO uint32_t GPIOECFGR;          /*!< RCC GPIOE configuration register                                               Address offset: 0x053C */
  __IO uint32_t GPIOFCFGR;          /*!< RCC GPIOF configuration register                                               Address offset: 0x0540 */
  __IO uint32_t GPIOGCFGR;          /*!< RCC GPIOG configuration register                                               Address offset: 0x0544 */
  __IO uint32_t GPIOHCFGR;          /*!< RCC GPIOH configuration register                                               Address offset: 0x0548 */
  __IO uint32_t GPIOICFGR;          /*!< RCC GPIOI configuration register                                               Address offset: 0x054C */
       uint32_t RESERVED9[2];       /*!< Reserved                                                                       Address offset: 0x0550-0x0554 */
  __IO uint32_t GPIOZCFGR;          /*!< RCC GPIOZ configuration register                                               Address offset: 0x0558 */
  __IO uint32_t HPDMA1CFGR;         /*!< RCC HPDMA1 configuration register                                              Address offset: 0x055C */
  __IO uint32_t HPDMA2CFGR;         /*!< RCC HPDMA2 configuration register                                              Address offset: 0x0560 */
  __IO uint32_t HPDMA3CFGR;         /*!< RCC HPDMA3 configuration register                                              Address offset: 0x0564 */
       uint32_t RESERVED10[2];      /*!< Reserved                                                                       Address offset: 0x0568-0x056C */
  __IO uint32_t IPCC1CFGR;          /*!< RCC IPCC1 configuration register                                               Address offset: 0x0570 */
       uint32_t RESERVED11;         /*!< Reserved                                                                       Address offset: 0x0574 */
  __IO uint32_t RTCCFGR;            /*!< RCC RTC configuration register                                                 Address offset: 0x0578 */
       uint32_t RESERVED12;         /*!< Reserved                                                                       Address offset: 0x057C */
  __IO uint32_t SYSCPU1CFGR;        /*!< RCC SYSCPU1 configuration register                                             Address offset: 0x0580 */
  __IO uint32_t BSECCFGR;           /*!< RCC BSEC configuration register                                                Address offset: 0x0584 */
       uint32_t RESERVED13[2];      /*!< Reserved                                                                       Address offset: 0x0588-0x058C */
  __IO uint32_t PLL2CFGR1;          /*!< RCC PLL2 configuration register 1                                              Address offset: 0x0590 */
  __IO uint32_t PLL2CFGR2;          /*!< RCC PLL2 configuration register 2                                              Address offset: 0x0594 */
  __IO uint32_t PLL2CFGR3;          /*!< RCC PLL2 configuration register 3                                              Address offset: 0x0598 */
  __IO uint32_t PLL2CFGR4;          /*!< RCC PLLx configuration register 4                                              Address offset: 0x059C */
  __IO uint32_t PLL2CFGR5;          /*!< RCC PLL2 configuration register 5                                              Address offset: 0x05A0 */
       uint32_t RESERVED14;         /*!< Reserved                                                                       Address offset: 0x05A4 */
  __IO uint32_t PLL2CFGR6;          /*!< RCC PLL2 configuration register 6                                              Address offset: 0x05A8 */
  __IO uint32_t PLL2CFGR7;          /*!< RCC PLL2 configuration register 7                                              Address offset: 0x05AC */
       uint32_t RESERVED15[12];     /*!< Reserved                                                                       Address offset: 0x05B0-0x05DC */
  __IO uint32_t HSIFMONCR;          /*!< RCC HSI frequency monitoring control register                                  Address offset: 0x05E0 */
  __IO uint32_t HSIFVALR;           /*!< RCC HSI frequency value register                                               Address offset: 0x05E4 */
  __IO uint32_t MSIFMONCR;          /*!< RCC MSI frequency monitoring control register                                  Address offset: 0x05E8 */
  __IO uint32_t MSIFVALR;           /*!< RCC MSI frequency value register                                               Address offset: 0x05EC */
       uint32_t RESERVED16[68];     /*!< Reserved                                                                       Address offset: 0x05F0-0x06FC */
  __IO uint32_t TIM1CFGR;           /*!< RCC TIM1 configuration register                                                Address offset: 0x0700 */
  __IO uint32_t TIM2CFGR;           /*!< RCC TIM2 configuration register                                                Address offset: 0x0704 */
  __IO uint32_t TIM3CFGR;           /*!< RCC TIM3 configuration register                                                Address offset: 0x0708 */
  __IO uint32_t TIM4CFGR;           /*!< RCC TIM4 configuration register                                                Address offset: 0x070C */
  __IO uint32_t TIM5CFGR;           /*!< RCC TIM5 configuration register                                                Address offset: 0x0710 */
  __IO uint32_t TIM6CFGR;           /*!< RCC TIM6 configuration register                                                Address offset: 0x0714 */
  __IO uint32_t TIM7CFGR;           /*!< RCC TIM7 configuration register                                                Address offset: 0x0718 */
  __IO uint32_t TIM8CFGR;           /*!< RCC TIM8 configuration register                                                Address offset: 0x071C */
  __IO uint32_t TIM10CFGR;          /*!< RCC TIM10 configuration register                                               Address offset: 0x0720 */
  __IO uint32_t TIM11CFGR;          /*!< RCC TIM11 configuration register                                               Address offset: 0x0724 */
  __IO uint32_t TIM12CFGR;          /*!< RCC TIM12 configuration register                                               Address offset: 0x0728 */
  __IO uint32_t TIM13CFGR;          /*!< RCC TIM13 configuration register                                               Address offset: 0x072C */
  __IO uint32_t TIM14CFGR;          /*!< RCC TIM14 configuration register                                               Address offset: 0x0730 */
  __IO uint32_t TIM15CFGR;          /*!< RCC TIM15 configuration register                                               Address offset: 0x0734 */
  __IO uint32_t TIM16CFGR;          /*!< RCC TIM16 configuration register                                               Address offset: 0x0738 */
  __IO uint32_t TIM17CFGR;          /*!< RCC TIM17 configuration register                                               Address offset: 0x073C */
       uint32_t RESERVED17;         /*!< Reserved                                                                       Address offset: 0x0740 */
  __IO uint32_t LPTIM1CFGR;         /*!< RCC LPTIM1 configuration register                                              Address offset: 0x0744 */
  __IO uint32_t LPTIM2CFGR;         /*!< RCC LPTIM2 configuration register                                              Address offset: 0x0748 */
  __IO uint32_t LPTIM3CFGR;         /*!< RCC LPTIM3 configuration register                                              Address offset: 0x074C */
  __IO uint32_t LPTIM4CFGR;         /*!< RCC LPTIM4 configuration register                                              Address offset: 0x0750 */
  __IO uint32_t LPTIM5CFGR;         /*!< RCC LPTIM5 configuration register                                              Address offset: 0x0754 */
  __IO uint32_t SPI1CFGR;           /*!< RCC SPI1 configuration register                                                Address offset: 0x0758 */
  __IO uint32_t SPI2CFGR;           /*!< RCC SPI2 configuration register                                                Address offset: 0x075C */
  __IO uint32_t SPI3CFGR;           /*!< RCC SPI3 configuration register                                                Address offset: 0x0760 */
  __IO uint32_t SPI4CFGR;           /*!< RCC SPI4 configuration register                                                Address offset: 0x0764 */
  __IO uint32_t SPI5CFGR;           /*!< RCC SPI5 configuration register                                                Address offset: 0x0768 */
  __IO uint32_t SPI6CFGR;           /*!< RCC SPI6 configuration register                                                Address offset: 0x076C */
       uint32_t RESERVED18[2];      /*!< Reserved                                                                       Address offset: 0x0770-0x0774 */
  __IO uint32_t SPDIFRXCFGR;        /*!< RCC SPDIFRX configuration register                                             Address offset: 0x0778 */
  __IO uint32_t USART1CFGR;         /*!< RCC USART1 configuration register                                              Address offset: 0x077C */
  __IO uint32_t USART2CFGR;         /*!< RCC USART2 configuration register                                              Address offset: 0x0780 */
  __IO uint32_t USART3CFGR;         /*!< RCC USART3 configuration register                                              Address offset: 0x0784 */
  __IO uint32_t UART4CFGR;          /*!< RCC UART4 configuration register                                               Address offset: 0x0788 */
  __IO uint32_t UART5CFGR;          /*!< RCC UART5 configuration register                                               Address offset: 0x078C */
  __IO uint32_t USART6CFGR;         /*!< RCC USART6 configuration register                                              Address offset: 0x0790 */
  __IO uint32_t UART7CFGR;          /*!< RCC UART7 configuration register                                               Address offset: 0x0794 */
       uint32_t RESERVED19[2];      /*!< Reserved                                                                       Address offset: 0x0798-0x079C */
  __IO uint32_t LPUART1CFGR;        /*!< RCC LPUART1 configuration register                                             Address offset: 0x07A0 */
  __IO uint32_t I2C1CFGR;           /*!< RCC I2C1 configuration register                                                Address offset: 0x07A4 */
  __IO uint32_t I2C2CFGR;           /*!< RCC I2C2 configuration register                                                Address offset: 0x07A8 */
  __IO uint32_t I2C3CFGR;           /*!< RCC I2C3 configuration register                                                Address offset: 0x07AC */
       uint32_t RESERVED20[5];      /*!< Reserved                                                                       Address offset: 0x07B0-0x07C0 */
  __IO uint32_t SAI1CFGR;           /*!< RCC SAI1 configuration register                                                Address offset: 0x07C4 */
  __IO uint32_t SAI2CFGR;           /*!< RCC SAI2 configuration register                                                Address offset: 0x07C8 */
  __IO uint32_t SAI3CFGR;           /*!< RCC SAI3 configuration register                                                Address offset: 0x07CC */
  __IO uint32_t SAI4CFGR;           /*!< RCC SAI4 configuration register                                                Address offset: 0x07D0 */
       uint32_t RESERVED21;         /*!< Reserved                                                                       Address offset: 0x07D4 */
  __IO uint32_t MDF1CFGR;           /*!< RCC MDF1 configuration register                                                Address offset: 0x07D8 */
       uint32_t RESERVED22;         /*!< Reserved                                                                       Address offset: 0x07DC */
