STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215axx_cm33.h
#define RIMC                        RIMC_NS
#define RIMC_BASE                   RIMC_BASE_NS

#define RIFSC_ID                    RIFSC_ID_NS
#define RIFSC_ID_BASE               RIFSC_ID_BASE_NS

#define IAC                         IAC_NS
#define IAC_BASE                    IAC_BASE_NS

#define RISAF1                      RISAF1_NS
#define RISAF1_BASE                 RISAF1_BASE_NS

#define RISAF2                      RISAF2_NS
#define RISAF2_BASE                 RISAF2_BASE_NS

#define RISAF4                      RISAF4_NS
#define RISAF4_BASE                 RISAF4_BASE_NS


#define RISAB1                      RISAB1_NS
#define RISAB1_BASE                 RISAB1_BASE_NS

#define RISAB2                      RISAB2_NS
#define RISAB2_BASE                 RISAB2_BASE_NS

#define RISAB3                      RISAB3_NS
#define RISAB3_BASE                 RISAB3_BASE_NS


#define RISAB5                      RISAB5_NS
#define RISAB5_BASE                 RISAB5_BASE_NS


/*!< APB3 peripherals defaults to Non secure aliases */
#define BSEC                        BSEC_NS
#define BSEC_BASE                   BSEC_BASE_NS

#define IWDG1                       IWDG1_NS
#define IWDG1_BASE                  IWDG1_BASE_NS

#define IWDG2                       IWDG2_NS
#define IWDG2_BASE                  IWDG2_BASE_NS

#define IWDG3                       IWDG3_NS
#define IWDG3_BASE                  IWDG3_BASE_NS

#define IWDG4                       IWDG4_NS
#define IWDG4_BASE                  IWDG4_BASE_NS

#define WWDG1                       WWDG1_NS
#define WWDG1_BASE                  WWDG1_BASE_NS

#define VREFBUF                     VREFBUF_NS
#define VREFBUF_BASE                VREFBUF_BASE_NS

#define DTS                         DTS_NS
#define DTS_BASE                    DTS_BASE_NS

#define SERC                        SERC_NS
#define SERC_BASE                   SERC_BASE_NS

#define HDP                         HDP_NS
#define HDP_BASE                    HDP_BASE_NS

/*!< AHB4 peripherals defaults to Non secure aliases */
#define RCC                         RCC_NS
#define RCC_BASE                    RCC_BASE_NS

#define PWR                         PWR_NS
#define PWR_BASE                    PWR_BASE_NS

#define EXTI1                       EXTI1_NS
#define EXTI1_BASE                  EXTI1_BASE_NS

#define EXTI1_C1                    EXTI1_C1_NS
#define EXTI1_C1_BASE               EXTI1_C1_BASE_NS

#define EXTI1_C2                    EXTI1_C2_NS
#define EXTI1_C2_BASE               EXTI1_C2_BASE_NS

#define SYSCFG                      SYSCFG_NS
#define SYSCFG_BASE                 SYSCFG_BASE_NS

#define GPIOA                       GPIOA_NS
#define GPIOA_BASE                  GPIOA_BASE_NS

#define GPIOB                       GPIOB_NS
#define GPIOB_BASE                  GPIOB_BASE_NS

#define GPIOC                       GPIOC_NS
#define GPIOC_BASE                  GPIOC_BASE_NS

#define GPIOD                       GPIOD_NS
#define GPIOD_BASE                  GPIOD_BASE_NS

#define GPIOE                       GPIOE_NS
#define GPIOE_BASE                  GPIOE_BASE_NS

#define GPIOF                       GPIOF_NS
#define GPIOF_BASE                  GPIOF_BASE_NS

#define GPIOG                       GPIOG_NS
#define GPIOG_BASE                  GPIOG_BASE_NS

#define GPIOH                       GPIOH_NS
#define GPIOH_BASE                  GPIOH_BASE_NS

#define GPIOI                       GPIOI_NS
#define GPIOI_BASE                  GPIOI_BASE_NS

/*!< SMART_RUN_APB peripherals defaults to Non secure aliases */
#define RTC                         RTC_NS
#define RTC_BASE                    RTC_BASE_NS

#define TAMP                        TAMP_NS
#define TAMP_BASE                   TAMP_BASE_NS

#define SPI6                        SPI6_NS
#define SPI6_BASE                   SPI6_BASE_NS

#define LPUART1                     LPUART1_NS
#define LPUART1_BASE                LPUART1_BASE_NS


#define LPTIM3                      LPTIM3_NS
#define LPTIM3_BASE                 LPTIM3_BASE_NS

#define LPTIM4                      LPTIM4_NS
#define LPTIM4_BASE                 LPTIM4_BASE_NS

#define LPTIM5                      LPTIM5_NS
#define LPTIM5_BASE                 LPTIM5_BASE_NS


/*!< SMART_RUN_AHB peripherals defaults to Non secure aliases */
#define GPIOZ                       GPIOZ_NS
#define GPIOZ_BASE                  GPIOZ_BASE_NS

#define ADF1                        ADF1_NS
#define ADF1_BASE                   ADF1_BASE_NS

#define ADF1_Filter0                ADF1_Filter0_NS
#define ADF1_Filter0_BASE           ADF1_Filter0_BASE_NS

#define EXTI2                       EXTI2_NS
#define EXTI2_BASE                  EXTI2_BASE_NS

#define EXTI2_C1                    EXTI2_C1_NS
#define EXTI2_C1_BASE               EXTI2_C1_BASE_NS

#define EXTI2_C2                    EXTI2_C2_NS
#define EXTI2_C2_BASE               EXTI2_C2_BASE_NS

#define EXTI2_C3                    EXTI2_C3_NS
#define EXTI2_C3_BASE               EXTI2_C3_BASE_NS

#define LTDC                        LTDC_NS
#define LTDC_BASE                   LTDC_BASE_NS

#define LTDC_Layer1                 LTDC_Layer1_NS
#define LTDC_Layer1_BASE            LTDC_Layer1_BASE_NS

#define LTDC_Layer2                 LTDC_Layer2_NS
#define LTDC_Layer2_BASE            LTDC_Layer2_BASE_NS

#define LTDC_Layer3                 LTDC_Layer3_NS
#define LTDC_Layer3_BASE            LTDC_Layer3_BASE_NS

#if ! (defined(STM32MP215AAO3) || defined(STM32MP215CAO3) || defined(STM32MP215DAO3) || defined(STM32MP215FAO3))
#define CSI                         CSI_NS
#define CSI_BASE                    CSI_BASE_NS
#endif /* ! (defined(STM32MP215AAO3) || defined(STM32MP215CAO3) || defined(STM32MP215DAO3) || defined(STM32MP215FAO3)) */

#define DCMIPP                      DCMIPP_NS
#define DCMIPP_BASE                 DCMIPP_BASE_NS

#define DDRC                        DDRC_NS
#define DDRC_BASE                   DDRC_BASE_NS

#define DDRDBG                      DDRDBG_NS
#define DDRDBG_BASE                 DDRDBG_BASE_NS
#define STGENR                      STGENR_NS
#define STGENR_BASE                 STGENR_BASE_NS

#define STGENC                      STGENC_NS
#define STGENC_BASE                 STGENC_BASE_NS


/*!< FMC Banks registers defaults to Non secure aliases */
#define FMC_Bank1_R                 FMC_Bank1_R_NS
#define FMC_Bank1_R_BASE            FMC_Bank1_R_BASE_NS

#define FMC_Bank1E_R                FMC_Bank1E_R_NS
#define FMC_Bank1E_R_BASE           FMC_Bank1E_R_BASE_NS

#define FMC_Bank3_R                 FMC_Bank3_R_NS
#define FMC_Bank3_R_BASE            FMC_Bank3_R_BASE_NS

