STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215axx_cm33.h
/*************  Bit definition for ETH_MTLRXQ1CR register  *************/
#define ETH_MTLRXQ1CR_RXQ_WEGT_Pos          (0U)
#define ETH_MTLRXQ1CR_RXQ_WEGT_Msk          (0x7UL << ETH_MTLRXQ1CR_RXQ_WEGT_Pos)                /*!< 0x00000007 */
#define ETH_MTLRXQ1CR_RXQ_WEGT              ETH_MTLRXQ1CR_RXQ_WEGT_Msk                          /*!< Receive Queue Weight */
#define ETH_MTLRXQ1CR_RXQ_WEGT_0            (0x1UL << ETH_MTLRXQ1CR_RXQ_WEGT_Pos)                /*!< 0x00000001 */
#define ETH_MTLRXQ1CR_RXQ_WEGT_1            (0x2UL << ETH_MTLRXQ1CR_RXQ_WEGT_Pos)                /*!< 0x00000002 */
#define ETH_MTLRXQ1CR_RXQ_WEGT_2            (0x4UL << ETH_MTLRXQ1CR_RXQ_WEGT_Pos)                /*!< 0x00000004 */
#define ETH_MTLRXQ1CR_RXQ_FRM_ARBIT_Pos     (3U)
#define ETH_MTLRXQ1CR_RXQ_FRM_ARBIT_Msk     (0x1UL << ETH_MTLRXQ1CR_RXQ_FRM_ARBIT_Pos)           /*!< 0x00000008 */
#define ETH_MTLRXQ1CR_RXQ_FRM_ARBIT         ETH_MTLRXQ1CR_RXQ_FRM_ARBIT_Msk                     /*!< Receive Queue Packet Arbitration */

/****************  Bit definition for ETH_MTLTXQ2OMR register  ****************/
#define ETH_MTLTXQ2OMR_FTQ_Pos               (0U)
#define ETH_MTLTXQ2OMR_FTQ_Msk               (0x1UL << ETH_MTLTXQ2OMR_FTQ_Pos)                    /*!< 0x00000001 */
#define ETH_MTLTXQ2OMR_FTQ                   ETH_MTLTXQ2OMR_FTQ_Msk                             /*!< Flush Transmit Queue */
#define ETH_MTLTXQ2OMR_TSF_Pos               (1U)
#define ETH_MTLTXQ2OMR_TSF_Msk               (0x1UL << ETH_MTLTXQ2OMR_TSF_Pos)                    /*!< 0x00000002 */
#define ETH_MTLTXQ2OMR_TSF                   ETH_MTLTXQ2OMR_TSF_Msk                             /*!< Transmit Store and Forward */
#define ETH_MTLTXQ2OMR_TXQEN_Pos             (2U)
#define ETH_MTLTXQ2OMR_TXQEN_Msk             (0x3UL << ETH_MTLTXQ2OMR_TXQEN_Pos)                  /*!< 0x0000000C */
#define ETH_MTLTXQ2OMR_TXQEN                 ETH_MTLTXQ2OMR_TXQEN_Msk                           /*!< Transmit Queue Enable */
#define ETH_MTLTXQ2OMR_TTC_Pos               (4U)
#define ETH_MTLTXQ2OMR_TTC_Msk               (0x7UL << ETH_MTLTXQ2OMR_TTC_Pos)                    /*!< 0x00000070 */
#define ETH_MTLTXQ2OMR_TTC                   ETH_MTLTXQ2OMR_TTC_Msk                             /*!< Transmit Threshold Control */
#define ETH_MTLTXQ2OMR_TQS_Pos               (16U)
#define ETH_MTLTXQ2OMR_TQS_Msk               (0x1FUL << ETH_MTLTXQ2OMR_TQS_Pos)                   /*!< 0x001F0000 */
#define ETH_MTLTXQ2OMR_TQS                   ETH_MTLTXQ2OMR_TQS_Msk                             /*!< Transmit queue size */

/****************  Bit definition for ETH_MTLTXQ2UR register  *****************/
#define ETH_MTLTXQ2UR_UFFRMCNT_Pos            (0U)
#define ETH_MTLTXQ2UR_UFFRMCNT_Msk            (0x7FFUL << ETH_MTLTXQ2UR_UFFRMCNT_Pos)             /*!< 0x000007FF */
#define ETH_MTLTXQ2UR_UFFRMCNT                ETH_MTLTXQ2UR_UFFRMCNT_Msk                        /*!< Underflow Packet Counter */
#define ETH_MTLTXQ2UR_UFCNTOVF_Pos            (11U)
#define ETH_MTLTXQ2UR_UFCNTOVF_Msk            (0x1UL << ETH_MTLTXQ2UR_UFCNTOVF_Pos)               /*!< 0x00000800 */
#define ETH_MTLTXQ2UR_UFCNTOVF                ETH_MTLTXQ2UR_UFCNTOVF_Msk                        /*!< Overflow Bit for Underflow Packet Counter */

/****************  Bit definition for ETH_MTLTXQ2DR register  *****************/
#define ETH_MTLTXQ2DR_TXQPAUSED_Pos          (0U)
#define ETH_MTLTXQ2DR_TXQPAUSED_Msk          (0x1UL << ETH_MTLTXQ2DR_TXQPAUSED_Pos)               /*!< 0x00000001 */
#define ETH_MTLTXQ2DR_TXQPAUSED              ETH_MTLTXQ2DR_TXQPAUSED_Msk                        /*!< Transmit Queue in Pause */
#define ETH_MTLTXQ2DR_TRCSTS_Pos             (1U)
#define ETH_MTLTXQ2DR_TRCSTS_Msk             (0x3UL << ETH_MTLTXQ2DR_TRCSTS_Pos)                  /*!< 0x00000006 */
#define ETH_MTLTXQ2DR_TRCSTS                 ETH_MTLTXQ2DR_TRCSTS_Msk                           /*!< MTL Tx Queue Read Controller Status */
#define ETH_MTLTXQ2DR_TWCSTS_Pos             (3U)
#define ETH_MTLTXQ2DR_TWCSTS_Msk             (0x1UL << ETH_MTLTXQ2DR_TWCSTS_Pos)                  /*!< 0x00000008 */
#define ETH_MTLTXQ2DR_TWCSTS                 ETH_MTLTXQ2DR_TWCSTS_Msk                           /*!< MTL Tx Queue Write Controller Status */
#define ETH_MTLTXQ2DR_TXQSTS_Pos             (4U)
#define ETH_MTLTXQ2DR_TXQSTS_Msk             (0x1UL << ETH_MTLTXQ2DR_TXQSTS_Pos)                  /*!< 0x00000010 */
#define ETH_MTLTXQ2DR_TXQSTS                 ETH_MTLTXQ2DR_TXQSTS_Msk                           /*!< MTL Tx Queue Not Empty Status */
#define ETH_MTLTXQ2DR_TXSTSFSTS_Pos          (5U)
#define ETH_MTLTXQ2DR_TXSTSFSTS_Msk          (0x1UL << ETH_MTLTXQ2DR_TXSTSFSTS_Pos)               /*!< 0x00000020 */
#define ETH_MTLTXQ2DR_TXSTSFSTS              ETH_MTLTXQ2DR_TXSTSFSTS_Msk                        /*!< MTL Tx Status FIFO Full Status */
#define ETH_MTLTXQ2DR_PTXQ_Pos               (16U)
#define ETH_MTLTXQ2DR_PTXQ_Msk               (0x7UL << ETH_MTLTXQ2DR_PTXQ_Pos)                    /*!< 0x00070000 */
#define ETH_MTLTXQ2DR_PTXQ                   ETH_MTLTXQ2DR_PTXQ_Msk                             /*!< Number of Packets in the Transmit Queue */
#define ETH_MTLTXQ2DR_STXSTSF_Pos            (20U)
#define ETH_MTLTXQ2DR_STXSTSF_Msk            (0x7UL << ETH_MTLTXQ2DR_STXSTSF_Pos)                 /*!< 0x00700000 */
#define ETH_MTLTXQ2DR_STXSTSF                ETH_MTLTXQ2DR_STXSTSF_Msk                          /*!< Number of Status Words in Tx Status FIFO of Queue */

/****************  Bit definition for ETH_MTLTXQ2ECR register  ****************/
#define ETH_MTLTXQ2ECR_AVALG_Pos             (2U)
#define ETH_MTLTXQ2ECR_AVALG_Msk             (0x1UL << ETH_MTLTXQ2ECR_AVALG_Pos)                  /*!< 0x00000004 */
#define ETH_MTLTXQ2ECR_AVALG                 ETH_MTLTXQ2ECR_AVALG_Msk                           /*!< AV Algorithm */
#define ETH_MTLTXQ2ECR_CC_Pos                (3U)
#define ETH_MTLTXQ2ECR_CC_Msk                (0x1UL << ETH_MTLTXQ2ECR_CC_Pos)                     /*!< 0x00000008 */
#define ETH_MTLTXQ2ECR_CC                    ETH_MTLTXQ2ECR_CC_Msk                              /*!< Credit Control */
#define ETH_MTLTXQ2ECR_SLC_Pos               (4U)
#define ETH_MTLTXQ2ECR_SLC_Msk               (0x7UL << ETH_MTLTXQ2ECR_SLC_Pos)                    /*!< 0x00000070 */
#define ETH_MTLTXQ2ECR_SLC                   ETH_MTLTXQ2ECR_SLC_Msk                             /*!< Slot Count */

/****************  Bit definition for ETH_MTLTXQ2ESR register  ****************/
#define ETH_MTLTXQ2ESR_ABS_Pos               (0U)
#define ETH_MTLTXQ2ESR_ABS_Msk               (0xFFFFFFUL << ETH_MTLTXQ2ESR_ABS_Pos)               /*!< 0x00FFFFFF */
#define ETH_MTLTXQ2ESR_ABS                   ETH_MTLTXQ2ESR_ABS_Msk                             /*!< Average Bits per Slot */

/****************  Bit definition for ETH_MTLTXQ2QWR register  ****************/
#define ETH_MTLTXQ2QWR_ISCQW_Pos             (0U)
#define ETH_MTLTXQ2QWR_ISCQW_Msk             (0x3FFFUL << ETH_MTLTXQ2QWR_ISCQW_Pos)               /*!< 0x00003FFF */
#define ETH_MTLTXQ2QWR_ISCQW                 ETH_MTLTXQ2QWR_ISCQW_Msk                           /*!< IdleSlopeCredit or Weights */

/***************  Bit definition for ETH_MTLTXQ2SSCR register  ****************/
#define ETH_MTLTXQ2SSCR_SSC_Pos              (0U)
#define ETH_MTLTXQ2SSCR_SSC_Msk              (0x3FFFUL << ETH_MTLTXQ2SSCR_SSC_Pos)                /*!< 0x00003FFF */
#define ETH_MTLTXQ2SSCR_SSC                  ETH_MTLTXQ2SSCR_SSC_Msk                            /*!< sendSlopeCredit Value */

/****************  Bit definition for ETH_MTL register  ****************/
#define ETH_MTLTXQ2HCR_HC_Pos                (0U)
#define ETH_MTLTXQ2HCR_HC_Msk                (0x1FFFFFFFUL << ETH_MTLTXQ2HCR_HC_Pos)              /*!< 0x1FFFFFFF */
#define ETH_MTLTXQ2HCR_HC                    ETH_MTLTXQ2HCR_HC_Msk                              /*!< hiCredit Value */

/****************  Bit definition for ETH_MTL register  ****************/
#define ETH_MTLTXQ2LCR_LC_Pos                (0U)
#define ETH_MTLTXQ2LCR_LC_Msk                (0x1FFFFFFFUL << ETH_MTLTXQ2LCR_LC_Pos)              /*!< 0x1FFFFFFF */
#define ETH_MTLTXQ2LCR_LC                    ETH_MTLTXQ2LCR_LC_Msk                              /*!< loCredit Value */

/****************  Bit definition for ETH_MTLQ2ICSR register  *****************/
#define ETH_MTLQ2ICSR_TXUNFIS_Pos            (0U)
#define ETH_MTLQ2ICSR_TXUNFIS_Msk            (0x1UL << ETH_MTLQ2ICSR_TXUNFIS_Pos)                 /*!< 0x00000001 */
#define ETH_MTLQ2ICSR_TXUNFIS                ETH_MTLQ2ICSR_TXUNFIS_Msk                          /*!< Transmit Queue Underflow Interrupt Status */
#define ETH_MTLQ2ICSR_ABPSIS_Pos             (1U)
#define ETH_MTLQ2ICSR_ABPSIS_Msk             (0x1UL << ETH_MTLQ2ICSR_ABPSIS_Pos)                  /*!< 0x00000002 */
#define ETH_MTLQ2ICSR_ABPSIS                 ETH_MTLQ2ICSR_ABPSIS_Msk                           /*!< Average Bits Per Slot Interrupt Status */
#define ETH_MTLQ2ICSR_TXUIE_Pos              (8U)
#define ETH_MTLQ2ICSR_TXUIE_Msk              (0x1UL << ETH_MTLQ2ICSR_TXUIE_Pos)                   /*!< 0x00000100 */
#define ETH_MTLQ2ICSR_TXUIE                  ETH_MTLQ2ICSR_TXUIE_Msk                            /*!< Transmit Queue Underflow Interrupt Enable */
#define ETH_MTLQ2ICSR_ABPSIE_Pos             (9U)
#define ETH_MTLQ2ICSR_ABPSIE_Msk             (0x1UL << ETH_MTLQ2ICSR_ABPSIE_Pos)                  /*!< 0x00000200 */
#define ETH_MTLQ2ICSR_ABPSIE                 ETH_MTLQ2ICSR_ABPSIE_Msk                           /*!< Average Bits Per Slot Interrupt Enable */
#define ETH_MTLQ2ICSR_RXOVFIS_Pos            (16U)
#define ETH_MTLQ2ICSR_RXOVFIS_Msk            (0x1UL << ETH_MTLQ2ICSR_RXOVFIS_Pos)                 /*!< 0x00010000 */
#define ETH_MTLQ2ICSR_RXOVFIS                ETH_MTLQ2ICSR_RXOVFIS_Msk                          /*!< Receive Queue Overflow Interrupt Status */
#define ETH_MTLQ2ICSR_RXOIE_Pos              (24U)
#define ETH_MTLQ2ICSR_RXOIE_Msk              (0x1UL << ETH_MTLQ2ICSR_RXOIE_Pos)                   /*!< 0x01000000 */
#define ETH_MTLQ2ICSR_RXOIE                  ETH_MTLQ2ICSR_RXOIE_Msk                            /*!< Receive Queue Overflow Interrupt Enable */

