STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215axx_cm33.h
/*****************  Bit definition for GICV2M_IIDR register  ******************/
#define GICV2M_IIDR_IMPLEMENTER_Pos             (0U)
#define GICV2M_IIDR_IMPLEMENTER_Msk             (0xFFFUL << GICV2M_IIDR_IMPLEMENTER_Pos)  /*!< 0x00000FFF */
#define GICV2M_IIDR_IMPLEMENTER                 GICV2M_IIDR_IMPLEMENTER_Msk          /*!< JEP106 code of the company that implements the GICV2M */
#define GICV2M_IIDR_REVISION_Pos                (12U)
#define GICV2M_IIDR_REVISION_Msk                (0xFUL << GICV2M_IIDR_REVISION_Pos)   /*!< 0x0000F000 */
#define GICV2M_IIDR_REVISION                    GICV2M_IIDR_REVISION_Msk             /*!< Revision number for the component */
#define GICV2M_IIDR_ARCH_VERSION_Pos            (16U)
#define GICV2M_IIDR_ARCH_VERSION_Msk            (0xFUL << GICV2M_IIDR_ARCH_VERSION_Pos) /*!< 0x000F0000 */
#define GICV2M_IIDR_ARCH_VERSION                GICV2M_IIDR_ARCH_VERSION_Msk         /*!< GICV2M architecture version */
#define GICV2M_IIDR_PRODUCT_ID_Pos              (20U)
#define GICV2M_IIDR_PRODUCT_ID_Msk              (0xFFFUL << GICV2M_IIDR_PRODUCT_ID_Pos) /*!< 0xFFF00000 */
#define GICV2M_IIDR_PRODUCT_ID                  GICV2M_IIDR_PRODUCT_ID_Msk           /*!< Product identifier */

/******************************************************************************/
/*                                                                            */
/*                                    HASH                                    */
/*                                                                            */
/******************************************************************************/
/******************  c7amba_hash1@v3_0                     ********************/

/******************  Bits definition for HASH_CR register  ********************/
#define HASH_CR_INIT_Pos          (2U)
#define HASH_CR_INIT_Msk          (0x1UL << HASH_CR_INIT_Pos)                   /*!< 0x00000004 */
#define HASH_CR_INIT              HASH_CR_INIT_Msk                             /*!< Initialize message digest calculation */
#define HASH_CR_DMAE_Pos          (3U)
#define HASH_CR_DMAE_Msk          (0x1UL << HASH_CR_DMAE_Pos)                   /*!< 0x00000008 */
#define HASH_CR_DMAE              HASH_CR_DMAE_Msk                             /*!< DMA enable */
#define HASH_CR_DATATYPE_Pos      (4U)
#define HASH_CR_DATATYPE_Msk      (0x3UL << HASH_CR_DATATYPE_Pos)               /*!< 0x00000030 */
#define HASH_CR_DATATYPE          HASH_CR_DATATYPE_Msk                         /*!< Data type selection */
#define HASH_CR_DATATYPE_0        (0x1UL << HASH_CR_DATATYPE_Pos)               /*!< 0x00000010 */
#define HASH_CR_DATATYPE_1        (0x2UL << HASH_CR_DATATYPE_Pos)               /*!< 0x00000020 */
#define HASH_CR_MODE_Pos          (6U)                                         
#define HASH_CR_MODE_Msk          (0x1UL << HASH_CR_MODE_Pos)                   /*!< 0x00000040 */
#define HASH_CR_MODE              HASH_CR_MODE_Msk                             /*!< Mode selection */
#define HASH_CR_ALGO_0            (0x1UL << HASH_CR_ALGO_Pos)
#define HASH_CR_ALGO_1            (0x2UL << HASH_CR_ALGO_Pos)
#define HASH_CR_ALGO_2            (0x4UL << HASH_CR_ALGO_Pos)
#define HASH_CR_ALGO_3            (0x8UL << HASH_CR_ALGO_Pos)
#define HASH_CR_NBW_Pos           (8U)
#define HASH_CR_NBW_Msk           (0xFUL << HASH_CR_NBW_Pos)                    /*!< 0x00000F00 */
#define HASH_CR_NBW               HASH_CR_NBW_Msk                              /*!< Number of words already pushed */
#define HASH_CR_NBW_0             (0x1UL << HASH_CR_NBW_Pos)                    /*!< 0x00000100 */
#define HASH_CR_NBW_1             (0x2UL << HASH_CR_NBW_Pos)                    /*!< 0x00000200 */
#define HASH_CR_NBW_2             (0x4UL << HASH_CR_NBW_Pos)                    /*!< 0x00000400 */
#define HASH_CR_NBW_3             (0x8UL << HASH_CR_NBW_Pos)                    /*!< 0x00000800 */
#define HASH_CR_DINNE_Pos         (12U)
#define HASH_CR_DINNE_Msk         (0x1UL << HASH_CR_DINNE_Pos)                  /*!< 0x00001000 */
#define HASH_CR_DINNE             HASH_CR_DINNE_Msk                            /*!< DIN not empty */
#define HASH_CR_MDMAT_Pos         (13U)
#define HASH_CR_MDMAT_Msk         (0x1UL << HASH_CR_MDMAT_Pos)                 /*!< 0x00002000 */
#define HASH_CR_MDMAT             HASH_CR_MDMAT_Msk                            /*!< Multiple DMA transfers */
#define HASH_CR_LKEY_Pos          (16U)
#define HASH_CR_LKEY_Msk          (0x1UL << HASH_CR_LKEY_Pos)                   /*!< 0x00010000 */
#define HASH_CR_LKEY              HASH_CR_LKEY_Msk                             /*!< Long key selection */
#define HASH_CR_ALGO_Pos          (17U)
#define HASH_CR_ALGO_Msk          (0xFUL << HASH_CR_ALGO_Pos)
#define HASH_CR_ALGO              HASH_CR_ALGO_Msk                             /*!< Algorithm selection */

/*******************  Bit definition for HASH_DIN register  *******************/
#define HASH_DIN_DATAIN_Pos          (0U)
#define HASH_DIN_DATAIN_Msk          (0xFFFFFFFFUL << HASH_DIN_DATAIN_Pos)      /*!< 0xFFFFFFFF */
#define HASH_DIN_DATAIN              HASH_DIN_DATAIN_Msk                       /*!< Data input */

/******************  Bits definition for HASH_STR register  *******************/
#define HASH_STR_NBLW_Pos         (0U)
#define HASH_STR_NBLW_Msk         (0x1FUL << HASH_STR_NBLW_Pos)                 /*!< 0x0000001F */
#define HASH_STR_NBLW             HASH_STR_NBLW_Msk                            /*!< Number of valid bits in the last word */
#define HASH_STR_NBLW_0           (0x01UL << HASH_STR_NBLW_Pos)                 /*!< 0x00000001 */
#define HASH_STR_NBLW_1           (0x02UL << HASH_STR_NBLW_Pos)                 /*!< 0x00000002 */
#define HASH_STR_NBLW_2           (0x04UL << HASH_STR_NBLW_Pos)                 /*!< 0x00000004 */
#define HASH_STR_NBLW_3           (0x08UL << HASH_STR_NBLW_Pos)                 /*!< 0x00000008 */
#define HASH_STR_NBLW_4           (0x10UL << HASH_STR_NBLW_Pos)                 /*!< 0x00000010 */
#define HASH_STR_DCAL_Pos         (8U)
#define HASH_STR_DCAL_Msk         (0x1UL << HASH_STR_DCAL_Pos)                  /*!< 0x00000100 */
#define HASH_STR_DCAL             HASH_STR_DCAL_Msk                            /*!< Digest calculation */

/******************  Bits definition for HASH_IMR register  *******************/
#define HASH_IMR_DINIE_Pos        (0U)
#define HASH_IMR_DINIE_Msk        (0x1UL << HASH_IMR_DINIE_Pos)                 /*!< 0x00000001 */
#define HASH_IMR_DINIE            HASH_IMR_DINIE_Msk                           /*!< Data input interrupt enable */
#define HASH_IMR_DCIE_Pos         (1U)
#define HASH_IMR_DCIE_Msk         (0x1UL << HASH_IMR_DCIE_Pos)                  /*!< 0x00000002 */
#define HASH_IMR_DCIE             HASH_IMR_DCIE_Msk                            /*!< Digest calculation completion interrupt enable */

/******************  Bits definition for HASH_SR register  ********************/
#define HASH_SR_DINIS_Pos         (0U)
#define HASH_SR_DINIS_Msk         (0x1UL << HASH_SR_DINIS_Pos)                  /*!< 0x00000001 */
#define HASH_SR_DINIS             HASH_SR_DINIS_Msk                            /*!< Data input interrupt status */
#define HASH_SR_DCIS_Pos          (1U)
#define HASH_SR_DCIS_Msk          (0x1UL << HASH_SR_DCIS_Pos)                   /*!< 0x00000002 */
#define HASH_SR_DCIS              HASH_SR_DCIS_Msk                             /*!< Digest calculation completion interrupt status */
#define HASH_SR_DMAS_Pos          (2U)
#define HASH_SR_DMAS_Msk          (0x1UL << HASH_SR_DMAS_Pos)                   /*!< 0x00000004 */
#define HASH_SR_DMAS              HASH_SR_DMAS_Msk                             /*!< DMA Status */
#define HASH_SR_BUSY_Pos          (3U)
#define HASH_SR_BUSY_Msk          (0x1UL << HASH_SR_BUSY_Pos)                   /*!< 0x00000008 */
#define HASH_SR_BUSY              HASH_SR_BUSY_Msk                             /*!< Busy bit */
#define HASH_SR_NBWP_Pos          (9U)
#define HASH_SR_NBWP_Msk          (0x3FUL << HASH_SR_NBWP_Pos)                  /*!< 0x00007E00 */
#define HASH_SR_NBWP              HASH_SR_NBWP_Msk                             /*!< Number of words already pushed */
#define HASH_SR_DINNE_Pos         (15U)
#define HASH_SR_DINNE_Msk         (0x1UL << HASH_SR_DINNE_Pos)                  /*!< 0x00008000 */
#define HASH_SR_DINNE             HASH_SR_DINNE_Msk                            /*!< DIN not empty */
#define HASH_SR_NBWE_Pos          (16U)
#define HASH_SR_NBWE_Msk          (0x3FUL << HASH_SR_NBWE_Pos)                  /*!< 0x003F0000 */
#define HASH_SR_NBWE              HASH_SR_NBWE_Msk                             /*!< Number of words expected */

