STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215axx_cm33.h
/***************  Bit fields for RCC_FINDIVxCFGR register */
#define RCC_FINDIVxCFGR_FINDIVx_Pos                (0U)
#define RCC_FINDIVxCFGR_FINDIVx_Msk                (0x3FUL << RCC_FINDIVxCFGR_FINDIVx_Pos)              /*!< 0x0000003F */
#define RCC_FINDIVxCFGR_FINDIVx                    RCC_FINDIVxCFGR_FINDIVx_Msk                       /*!< Channel 0 divider ratio */
#define RCC_FINDIVxCFGR_FINDIVxEN_Pos              (6U)
#define RCC_FINDIVxCFGR_FINDIVxEN_Msk              (0x1UL << RCC_FINDIVxCFGR_FINDIVxEN_Pos)             /*!< 0x00000040 */
#define RCC_FINDIVxCFGR_FINDIVxEN                  RCC_FINDIVxCFGR_FINDIVxEN_Msk                     /*!< Final divider channel 0 output enable */

/* Bit fields for RCC_FINDIVSR1 register */
#define RCC_FINDIVSR1_FINDIVSTS_Pos                (0U)
#define RCC_FINDIVSR1_FINDIVSTS_Msk                (0xFFFFFFFFUL << RCC_FINDIVSR1_FINDIVSTS_Pos)        /*!< 0xFFFFFFFF */
#define RCC_FINDIVSR1_FINDIVSTS                    RCC_FINDIVSR1_FINDIVSTS_Msk                       /*!< Final divider channel[31:0] output status */

/* Bit fields for RCC_FINDIVSR2 register */
#define RCC_FINDIVSR2_FINDIVSTS_Pos                (0U)
#define RCC_FINDIVSR2_FINDIVSTS_Msk                (0xFFFFFFFFUL << RCC_FINDIVSR2_FINDIVSTS_Pos)        /*!< 0xFFFFFFFF */
#define RCC_FINDIVSR2_FINDIVSTS                    RCC_FINDIVSR2_FINDIVSTS_Msk                       /*!< Final divider channel[63:32] output status */

/**************  Bit fields for RCC_FCALCOBS0CFGR register  ***************/
#define RCC_FCALCOBS0CFGR_CKINTSEL_Pos             (0U)
#define RCC_FCALCOBS0CFGR_CKINTSEL_Msk             (0xFFUL << RCC_FCALCOBS0CFGR_CKINTSEL_Pos)           /*!< 0x000000FF */
#define RCC_FCALCOBS0CFGR_CKINTSEL                 RCC_FCALCOBS0CFGR_CKINTSEL_Msk                    /*!< Internal clock selector for clock frequency calculator and observation clock 0 */
#define RCC_FCALCOBS0CFGR_CKEXTSEL_Pos             (8U)
#define RCC_FCALCOBS0CFGR_CKEXTSEL_Msk             (0x7UL << RCC_FCALCOBS0CFGR_CKEXTSEL_Pos)            /*!< 0x00000700 */
#define RCC_FCALCOBS0CFGR_CKEXTSEL                 RCC_FCALCOBS0CFGR_CKEXTSEL_Msk                    /*!< External clock selector for clock frequency calculator and */
#define RCC_FCALCOBS0CFGR_FCALCCKEXTSEL_Pos        (15U)
#define RCC_FCALCOBS0CFGR_FCALCCKEXTSEL_Msk        (0x1UL << RCC_FCALCOBS0CFGR_FCALCCKEXTSEL_Pos)       /*!< 0x00008000 */
#define RCC_FCALCOBS0CFGR_FCALCCKEXTSEL            RCC_FCALCOBS0CFGR_FCALCCKEXTSEL_Msk                 /*!< External clock source for clock frequency calculator input clock */
#define RCC_FCALCOBS0CFGR_CKOBSEXTSEL_Pos          (16U)
#define RCC_FCALCOBS0CFGR_CKOBSEXTSEL_Msk          (0x1UL << RCC_FCALCOBS0CFGR_CKOBSEXTSEL_Pos)         /*!< 0x00010000 */
#define RCC_FCALCOBS0CFGR_CKOBSEXTSEL              RCC_FCALCOBS0CFGR_CKOBSEXTSEL_Msk                   /*!< External clock source for observation clock 0 */
#define RCC_FCALCOBS0CFGR_FCALCCKINV_Pos           (17U)
#define RCC_FCALCOBS0CFGR_FCALCCKINV_Msk           (0x1UL << RCC_FCALCOBS0CFGR_FCALCCKINV_Pos)          /*!< 0x00020000 */
#define RCC_FCALCOBS0CFGR_FCALCCKINV               RCC_FCALCOBS0CFGR_FCALCCKINV_Msk                    /*!< Clock frequency calculator input clock inverter */
#define RCC_FCALCOBS0CFGR_CKOBSINV_Pos             (18U)
#define RCC_FCALCOBS0CFGR_CKOBSINV_Msk             (0x1UL << RCC_FCALCOBS0CFGR_CKOBSINV_Pos)            /*!< 0x00040000 */
#define RCC_FCALCOBS0CFGR_CKOBSINV                 RCC_FCALCOBS0CFGR_CKOBSINV_Msk                    /*!< Observation clock 0 inverter */
#define RCC_FCALCOBS0CFGR_CKOBSDIV_Pos             (22U)
#define RCC_FCALCOBS0CFGR_CKOBSDIV_Msk             (0x7UL << RCC_FCALCOBS0CFGR_CKOBSDIV_Pos)            /*!< 0x01C00000 */
#define RCC_FCALCOBS0CFGR_CKOBSDIV                 RCC_FCALCOBS0CFGR_CKOBSDIV_Msk                    /*!< Observation clock 0 divide ratio */
#define RCC_FCALCOBS0CFGR_FCALCCKEN_Pos            (25U)
#define RCC_FCALCOBS0CFGR_FCALCCKEN_Msk            (0x1UL << RCC_FCALCOBS0CFGR_FCALCCKEN_Pos)           /*!< 0x02000000 */
#define RCC_FCALCOBS0CFGR_FCALCCKEN                RCC_FCALCOBS0CFGR_FCALCCKEN_Msk                   /*!< Clock frequency calculator input clock enable */
#define RCC_FCALCOBS0CFGR_CKOBSEN_Pos              (26U)
#define RCC_FCALCOBS0CFGR_CKOBSEN_Msk              (0x1UL << RCC_FCALCOBS0CFGR_CKOBSEN_Pos)             /*!< 0x04000000 */
#define RCC_FCALCOBS0CFGR_CKOBSEN                  RCC_FCALCOBS0CFGR_CKOBSEN_Msk                     /*!< Observation clock 0 output enable */

/**************  Bit fields for RCC_FCALCOBS1CFGR register  ***************/
#define RCC_FCALCOBS1CFGR_CKINTSEL_Pos             (0U)
#define RCC_FCALCOBS1CFGR_CKINTSEL_Msk             (0xFFUL << RCC_FCALCOBS1CFGR_CKINTSEL_Pos)           /*!< 0x000000FF */
#define RCC_FCALCOBS1CFGR_CKINTSEL                 RCC_FCALCOBS1CFGR_CKINTSEL_Msk                    /*!< Internal clock selector for observation clock 1 */
#define RCC_FCALCOBS1CFGR_CKEXTSEL_Pos             (8U)
#define RCC_FCALCOBS1CFGR_CKEXTSEL_Msk             (0x7UL << RCC_FCALCOBS1CFGR_CKEXTSEL_Pos)            /*!< 0x00000700 */
#define RCC_FCALCOBS1CFGR_CKEXTSEL                 RCC_FCALCOBS1CFGR_CKEXTSEL_Msk                    /*!< External clock for observation clock 1 */
#define RCC_FCALCOBS1CFGR_CKOBSEXTSEL_Pos          (16U)
#define RCC_FCALCOBS1CFGR_CKOBSEXTSEL_Msk          (0x1UL << RCC_FCALCOBS1CFGR_CKOBSEXTSEL_Pos)         /*!< 0x00010000 */
#define RCC_FCALCOBS1CFGR_CKOBSEXTSEL              RCC_FCALCOBS1CFGR_CKOBSEXTSEL_Msk                   /*!< External clock source for the observation clock 1 */
#define RCC_FCALCOBS1CFGR_CKOBSINV_Pos             (18U)
#define RCC_FCALCOBS1CFGR_CKOBSINV_Msk             (0x1UL << RCC_FCALCOBS1CFGR_CKOBSINV_Pos)            /*!< 0x00040000 */
#define RCC_FCALCOBS1CFGR_CKOBSINV                 RCC_FCALCOBS1CFGR_CKOBSINV_Msk                    /*!< Observation clock 1 inverter */
#define RCC_FCALCOBS1CFGR_CKOBSDIV_Pos             (22U)
#define RCC_FCALCOBS1CFGR_CKOBSDIV_Msk             (0x7UL << RCC_FCALCOBS1CFGR_CKOBSDIV_Pos)            /*!< 0x01C00000 */
#define RCC_FCALCOBS1CFGR_CKOBSDIV                 RCC_FCALCOBS1CFGR_CKOBSDIV_Msk                    /*!< Observation clock 1 divide ratio */
#define RCC_FCALCOBS1CFGR_CKOBSEN_Pos              (26U)
#define RCC_FCALCOBS1CFGR_CKOBSEN_Msk              (0x1UL << RCC_FCALCOBS1CFGR_CKOBSEN_Pos)             /*!< 0x04000000 */
#define RCC_FCALCOBS1CFGR_CKOBSEN                  RCC_FCALCOBS1CFGR_CKOBSEN_Msk                     /*!< Observation clock 1 output enable */
#define RCC_FCALCOBS1CFGR_FCALCRSTN_Pos            (27U)
#define RCC_FCALCOBS1CFGR_FCALCRSTN_Msk            (0x1UL << RCC_FCALCOBS1CFGR_FCALCRSTN_Pos)           /*!< 0x08000000 */
#define RCC_FCALCOBS1CFGR_FCALCRSTN                RCC_FCALCOBS1CFGR_FCALCRSTN_Msk                   /*!< Clock frequency calculator reset */

/***************  Bit fields for RCC_FCALCREFCFGR register  ***************/
#define RCC_FCALCREFCFGR_FCALCREFCKSEL_Pos         (0U)
#define RCC_FCALCREFCFGR_FCALCREFCKSEL_Msk         (0x7UL << RCC_FCALCREFCFGR_FCALCREFCKSEL_Pos)        /*!< 0x00000007 */
#define RCC_FCALCREFCFGR_FCALCREFCKSEL             RCC_FCALCREFCFGR_FCALCREFCKSEL_Msk                  /*!< Reference clock selection used by clock frequency calculator */

/* Bit fields for RCC_FCALCCR1 register */
#define RCC_FCALCCR1_FCALCRUN_Pos                  (0U)
#define RCC_FCALCCR1_FCALCRUN_Msk                  (0x1UL << RCC_FCALCCR1_FCALCRUN_Pos)                 /*!< 0x00000001 */
#define RCC_FCALCCR1_FCALCRUN                      RCC_FCALCCR1_FCALCRUN_Msk                         /*!< Clock frequency calculator run */

/* Bit fields for RCC_FCALCCR2 register */
#define RCC_FCALCCR2_FCALCMD_Pos                   (3U)
#define RCC_FCALCCR2_FCALCMD_Msk                   (0x3UL << RCC_FCALCCR2_FCALCMD_Pos)                  /*!< 0x00000018 */
#define RCC_FCALCCR2_FCALCMD                       RCC_FCALCCR2_FCALCMD_Msk                          /*!< Clock frequency calculation method */
#define RCC_FCALCCR2_FCALCTWC_Pos                  (11U)
#define RCC_FCALCCR2_FCALCTWC_Msk                  (0xFUL << RCC_FCALCCR2_FCALCTWC_Pos)                 /*!< 0x00007800 */
#define RCC_FCALCCR2_FCALCTWC                      RCC_FCALCCR2_FCALCTWC_Msk                         /*!< Time window code for clock frequency calculation */
#define RCC_FCALCCR2_FCALCTYP_Pos                  (17U)
#define RCC_FCALCCR2_FCALCTYP_Msk                  (0x1FUL << RCC_FCALCCR2_FCALCTYP_Pos)                /*!< 0x003E0000 */
#define RCC_FCALCCR2_FCALCTYP                      RCC_FCALCCR2_FCALCTYP_Msk                         /*!< Clock frequency calculation type selection */

/* Bit fields for RCC_FCALCSR register  ******************/
#define RCC_FCALCSR_FVAL_Pos                     (0U)
#define RCC_FCALCSR_FVAL_Msk                     (0x1FFFFUL << RCC_FCALCSR_FVAL_Pos)                  /*!< 0x0001FFFF */
#define RCC_FCALCSR_FVAL                         RCC_FCALCSR_FVAL_Msk                              /*!< Clock frequency calculation value */
#define RCC_FCALCSR_FCALCSTS_Pos                 (19U)
#define RCC_FCALCSR_FCALCSTS_Msk                 (0x1UL << RCC_FCALCSR_FCALCSTS_Pos)                  /*!< 0x00080000 */
#define RCC_FCALCSR_FCALCSTS                     RCC_FCALCSR_FCALCSTS_Msk                          /*!< Clock frequency calculation status */

/* Bit fields for RCC_PLL4CFGR1 register */
#define RCC_PLL4CFGR1_SSMODRST_Pos                 (0U)
#define RCC_PLL4CFGR1_SSMODRST_Msk                 (0x1UL << RCC_PLL4CFGR1_SSMODRST_Pos)                /*!< 0x00000001 */
#define RCC_PLL4CFGR1_SSMODRST                     RCC_PLL4CFGR1_SSMODRST_Msk                        /*!< PLLy spread-spectrum modulator reset */
#define RCC_PLL4CFGR1_PLLEN_Pos                    (8U)
#define RCC_PLL4CFGR1_PLLEN_Msk                    (0x1UL << RCC_PLL4CFGR1_PLLEN_Pos)                   /*!< 0x00000100 */
#define RCC_PLL4CFGR1_PLLEN                        RCC_PLL4CFGR1_PLLEN_Msk                           /*!< PLLy enable */
#define RCC_PLL4CFGR1_PLLRDY_Pos                   (24U)
#define RCC_PLL4CFGR1_PLLRDY_Msk                   (0x1UL << RCC_PLL4CFGR1_PLLRDY_Pos)                  /*!< 0x01000000 */
#define RCC_PLL4CFGR1_PLLRDY                       RCC_PLL4CFGR1_PLLRDY_Msk                          /*!< PLLy clock ready flag */
#define RCC_PLL4CFGR1_CKREFST_Pos                  (28U)
#define RCC_PLL4CFGR1_CKREFST_Msk                  (0x1UL << RCC_PLL4CFGR1_CKREFST_Pos)                 /*!< 0x10000000 */
#define RCC_PLL4CFGR1_CKREFST                      RCC_PLL4CFGR1_CKREFST_Msk                         /*!< PLLy reference clock state */

/* Bit fields for RCC_PLL4CFGR2 register */
#define RCC_PLL4CFGR2_FREFDIV_Pos                  (0U)
#define RCC_PLL4CFGR2_FREFDIV_Msk                  (0x3FUL << RCC_PLL4CFGR2_FREFDIV_Pos)                /*!< 0x0000003F */
#define RCC_PLL4CFGR2_FREFDIV                      RCC_PLL4CFGR2_FREFDIV_Msk                         /*!< PLLy reference input clock divide frequency ratio */
#define RCC_PLL4CFGR2_FBDIV_Pos                    (16U)
#define RCC_PLL4CFGR2_FBDIV_Msk                    (0xFFFUL << RCC_PLL4CFGR2_FBDIV_Pos)                 /*!< 0x0FFF0000 */
#define RCC_PLL4CFGR2_FBDIV                        RCC_PLL4CFGR2_FBDIV_Msk                           /*!< PLLy VCO multiplication factor */

/* Bit fields for RCC_PLL4CFGR3 register */
#define RCC_PLL4CFGR3_FRACIN_Pos                   (0U)
#define RCC_PLL4CFGR3_FRACIN_Msk                   (0xFFFFFFUL << RCC_PLL4CFGR3_FRACIN_Pos)             /*!< 0x00FFFFFF */
#define RCC_PLL4CFGR3_FRACIN                       RCC_PLL4CFGR3_FRACIN_Msk                          /*!< Fractional part of PLLy VCO multiplication factor */
#define RCC_PLL4CFGR3_DOWNSPREAD_Pos               (24U)
#define RCC_PLL4CFGR3_DOWNSPREAD_Msk               (0x1UL << RCC_PLL4CFGR3_DOWNSPREAD_Pos)              /*!< 0x01000000 */
#define RCC_PLL4CFGR3_DOWNSPREAD                   RCC_PLL4CFGR3_DOWNSPREAD_Msk                      /*!< PLLy VCO frequency modulation mode */
#define RCC_PLL4CFGR3_DACEN_Pos                    (25U)
#define RCC_PLL4CFGR3_DACEN_Msk                    (0x1UL << RCC_PLL4CFGR3_DACEN_Pos)                   /*!< 0x02000000 */
#define RCC_PLL4CFGR3_DACEN                        RCC_PLL4CFGR3_DACEN_Msk                           /*!< PLLy noise canceling DAC enable in fractional mode */
#define RCC_PLL4CFGR3_SSCGDIS_Pos                  (26U)
#define RCC_PLL4CFGR3_SSCGDIS_Msk                  (0x1UL << RCC_PLL4CFGR3_SSCGDIS_Pos)                 /*!< 0x04000000 */
#define RCC_PLL4CFGR3_SSCGDIS                      RCC_PLL4CFGR3_SSCGDIS_Msk                         /*!< PLLy spread-spectrum modulator disable */

/* Bit fields for RCC_PLL4CFGR4 register */
#define RCC_PLL4CFGR4_DSMEN_Pos                    (8U)
#define RCC_PLL4CFGR4_DSMEN_Msk                    (0x1UL << RCC_PLL4CFGR4_DSMEN_Pos)                   /*!< 0x00000100 */
#define RCC_PLL4CFGR4_DSMEN                        RCC_PLL4CFGR4_DSMEN_Msk                           /*!< PLLy delta-sigma modulator enable */
#define RCC_PLL4CFGR4_FOUTPOSTDIVEN_Pos            (9U)
#define RCC_PLL4CFGR4_FOUTPOSTDIVEN_Msk            (0x1UL << RCC_PLL4CFGR4_FOUTPOSTDIVEN_Pos)           /*!< 0x00000200 */
#define RCC_PLL4CFGR4_FOUTPOSTDIVEN                RCC_PLL4CFGR4_FOUTPOSTDIVEN_Msk                   /*!< PLLy output and post dividers enable */
#define RCC_PLL4CFGR4_BYPASS_Pos                   (10U)
#define RCC_PLL4CFGR4_BYPASS_Msk                   (0x1UL << RCC_PLL4CFGR4_BYPASS_Pos)                  /*!< 0x00000400 */
#define RCC_PLL4CFGR4_BYPASS                       RCC_PLL4CFGR4_BYPASS_Msk                          /*!< PLLy FOUTPOSTDIV bypass */

/* Bit fields for RCC_PLL4CFGR5 register */
#define RCC_PLL4CFGR5_DIVVAL_Pos                   (0U)
#define RCC_PLL4CFGR5_DIVVAL_Msk                   (0xFUL << RCC_PLL4CFGR5_DIVVAL_Pos)                  /*!< 0x0000000F */
#define RCC_PLL4CFGR5_DIVVAL                       RCC_PLL4CFGR5_DIVVAL_Msk                          /*!< Modulation frequency adjustment for PLLy */
#define RCC_PLL4CFGR5_SPREAD_Pos                   (16U)
#define RCC_PLL4CFGR5_SPREAD_Msk                   (0x1FUL << RCC_PLL4CFGR5_SPREAD_Pos)                 /*!< 0x001F0000 */
#define RCC_PLL4CFGR5_SPREAD                       RCC_PLL4CFGR5_SPREAD_Msk                          /*!< Modulation depth adjustment for PLLy */

/* Bit fields for RCC_PLL4CFGR6 register */
#define RCC_PLL4CFGR6_POSTDIV1_Pos                 (0U)
#define RCC_PLL4CFGR6_POSTDIV1_Msk                 (0x7UL << RCC_PLL4CFGR6_POSTDIV1_Pos)                /*!< 0x00000007 */
#define RCC_PLL4CFGR6_POSTDIV1                     RCC_PLL4CFGR6_POSTDIV1_Msk                        /*!< PLLy VCO frequency divide level 1 */

