STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215axx_cm33.h
/******************************* FDCAN Instances *******************************/
#define IS_FDCAN_ALL_INSTANCE(INSTANCE) (((INSTANCE) == FDCAN1_S) || ((INSTANCE) == FDCAN1_NS) || \
                                         ((INSTANCE) == FDCAN2_S) || ((INSTANCE) == FDCAN2_NS))
#define IS_FDCAN_TT_INSTANCE(INSTANCE) (((INSTANCE) == FDCAN1_S) || ((INSTANCE) == FDCAN1_NS))
/******************************* GPIO Instances *******************************/
#define IS_GPIO_ALL_INSTANCE(INSTANCE) (((INSTANCE) == GPIOA_S) || ((INSTANCE) == GPIOA_NS) || \
                                        ((INSTANCE) == GPIOB_S) || ((INSTANCE) == GPIOB_NS) || \
                                        ((INSTANCE) == GPIOC_S) || ((INSTANCE) == GPIOC_NS) || \
                                        ((INSTANCE) == GPIOD_S) || ((INSTANCE) == GPIOD_NS) || \
                                        ((INSTANCE) == GPIOE_S) || ((INSTANCE) == GPIOE_NS) || \
                                        ((INSTANCE) == GPIOF_S) || ((INSTANCE) == GPIOF_NS) || \
                                        ((INSTANCE) == GPIOG_S) || ((INSTANCE) == GPIOG_NS) || \
                                        ((INSTANCE) == GPIOH_S) || ((INSTANCE) == GPIOH_NS) || \
                                        ((INSTANCE) == GPIOI_S) || ((INSTANCE) == GPIOI_NS) || \
                                        ((INSTANCE) == GPIOZ_S) || ((INSTANCE) == GPIOZ_NS))
/**************************** GPIO AF Instances *******************************/
/* On MP2, all GPIO Bank support AF */
#define IS_GPIO_AF_INSTANCE IS_GPIO_ALL_INSTANCE

/**************************** GPIO Lock Instances *****************************/
/* On MP2, all GPIO Bank support the Lock mechanism */
#define IS_GPIO_LOCK_INSTANCE(INSTANCE) IS_GPIO_ALL_INSTANCE(INSTANCE)

/******************************* HASH Instances ********************************/
#define IS_HASH_ALL_INSTANCE(INSTANCE) (((INSTANCE) == HASH1_S) || ((INSTANCE) == HASH1_NS) || \
                                        ((INSTANCE) == HASH2_S) || ((INSTANCE) == HASH2_NS))

/******************************* HASH Instances ********************************/
#define IS_HASH_DIGEST_ALL_INSTANCE(INSTANCE) (((INSTANCE) == HASH1_DIGEST_S) || ((INSTANCE) == HASH1_DIGEST_NS) || \
                                               ((INSTANCE) == HASH2_DIGEST_S) || ((INSTANCE) == HASH2_DIGEST_NS))

/******************************* HSEM Instances *******************************/
#define IS_HSEM_ALL_INSTANCE(INSTANCE) (((INSTANCE) == HSEM_S) || ((INSTANCE) == HSEM_NS))
/*********************  Bit definition for HSEM_CR register  ******************/
#define HSEM_CPU1_COREID    (0x00000001UL) /* Semaphore Core CA35 ID */
#define HSEM_CPU2_COREID    (0x00000002UL) /* Semaphore Core CM33 ID */
#define HSEM_CPU3_COREID    (0x00000003UL) /* Semaphore Core CM0PLUS ID */
#define HSEM_CR_COREID_CURRENT   (HSEM_CPU2_COREID << HSEM_CR_COREID_Pos)

#define HSEM_SEMID_MIN     (0U)       /* HSEM ID Min*/
#define HSEM_SEMID_MAX     (15U)      /* HSEM ID Max */

#define HSEM_PROCESSID_MIN (0U)       /* HSEM Process ID Min */
#define HSEM_PROCESSID_MAX (255U)     /* HSEM Process ID Max */

#define HSEM_CLEAR_KEY_MIN (0U)       /* HSEM clear Key Min value */
#define HSEM_CLEAR_KEY_MAX (0xFFFFU)  /* HSEM clear Key Max value */

/******************************* ICACHE Instances *******************************/
#define IS_ICACHE_ALL_INSTANCE(INSTANCE) (((INSTANCE) == ICACHE_S) || ((INSTANCE) == ICACHE_NS))

/******************************** I3C Instances *******************************/
#define IS_I3C_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I3C1_NS) || ((INSTANCE) == I3C1_S) || \
                                       ((INSTANCE) == I3C2_NS) || ((INSTANCE) == I3C2_S) || \
                                       ((INSTANCE) == I3C3_NS) || ((INSTANCE) == I3C3_S))
/******************************** I2C Instances *******************************/
#define IS_I2C_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1_S) || ((INSTANCE) == I2C1_NS) || \
                                       ((INSTANCE) == I2C2_S) || ((INSTANCE) == I2C2_NS) || \
                                       ((INSTANCE) == I2C3_S) || ((INSTANCE) == I2C3_NS))
/******************* I2C Instances : Group belongingness *********************/
#define IS_I2C_GRP1_INSTANCE(INSTANCE) (((INSTANCE) == I2C1_NS) || ((INSTANCE) == I2C1_S)|| \
                                        ((INSTANCE) == I2C2_NS) || ((INSTANCE) == I2C2_S))
#define IS_I2C_GRP2_INSTANCE(INSTANCE) (((INSTANCE) == I2C3_NS) || ((INSTANCE) == I2C3_S))

/************** I2C Instances : wakeup capability from stop modes *************/
#define IS_I2C_WAKEUP_FROMSTOP_INSTANCE(INSTANCE) IS_I2C_ALL_INSTANCE(INSTANCE)


/******************************* I2S Instances ****************************/
#define IS_I2S_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SPI1_S) || ((INSTANCE) == SPI1_NS) || \
                                       ((INSTANCE) == SPI2_S) || ((INSTANCE) == SPI2_NS) || \
                                       ((INSTANCE) == SPI3_S) || ((INSTANCE) == SPI3_NS))

/****************************** SMBUS Instances *******************************/
#define IS_SMBUS_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1_S) || ((INSTANCE) == I2C1_NS) || \
                                         ((INSTANCE) == I2C2_S) || ((INSTANCE) == I2C2_NS) || \
                                         ((INSTANCE) == I2C3_S) || ((INSTANCE) == I2C3_NS))

/******************* SMBUS Instances : Group belongingness *********************/
#define IS_SMBUS_GRP1_INSTANCE(INSTANCE) (((INSTANCE) == I2C1_NS) || ((INSTANCE) == I2C1_S)|| \
                                          ((INSTANCE) == I2C2_NS) || ((INSTANCE) == I2C2_S)) 
#define IS_SMBUS_GRP2_INSTANCE(INSTANCE) (((INSTANCE) == I2C3_NS) || ((INSTANCE) == I2C3_S))

/************** SMBUS Instances : trigger input *******************************/
#define IS_SMBUS_TRIGGER_INPUT_INSTANCE(INSTANCE) (IS_SMBUS_GRP1_INSTANCE(INSTANCE) ||\
                                                   IS_SMBUS_GRP2_INSTANCE(INSTANCE))

/******************************* IPCC Instances *******************************/
#define IS_IPCC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == IPCC1_S) || ((INSTANCE) == IPCC1_NS))
 
